---
kind: other
id: Methods.T:Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer
source: html/7861f10c-22aa-da99-411f-26b2b99ca705.htm
---
# IDuctFittingAndAccessoryPressureDropUIServer Methods

Returns the Id of the corresponding DB server for which this server provides an optional UI.